<?php

return [
    'provider' => env('PHONE_SMS_PROVIDER'),
    'providers' => [
        'test' => [
            'class' => \RaifuCore\Phone\Providers\TestProvider::class,
            'config' => [
                'code' => '7777',
                'number' => '78009997777'
            ]
        ],
        'smsru' => [
            'class' => \RaifuCore\Phone\Providers\SmsruProvider::class,
            'config' => [
                'apikey' => env('PHONE_SMS_PROVIDER_SMSRU_APIKEY', ''),
                'sender' => null,
            ]
        ],
        'greensms' => [
            'class' => \RaifuCore\Phone\Providers\GreensmsProvider::class,
            'config' => [
                'login' => env('PHONE_SMS_PROVIDER_GREENSMS_LOGIN', ''),
                'password' => env('PHONE_SMS_PROVIDER_GREENSMS_PASSWORD', ''),
                'sender' => null,
            ]
        ]
    ],
    'templates' => [
        'ad' => ['code' => 376, 'length' => 9, 'regex' => '^376\d{6}$', 'mask' => '___-___',], // Андорра
        'ae' => ['code' => 971, 'length' => 12, 'regex' => '^971\d{9}$', 'mask' => '__-___-____',], // ОАЭ
        'af' => ['code' => 93, 'length' => 11, 'regex' => '^93\d{9}$', 'mask' => '__ ___ ____',], // Афганистан
        'al' => ['code' => 355, 'length' => 12, 'regex' => '^355\d{9}$', 'mask' => '___ ___ ___',], // Албания
        'am' => ['code' => 374, 'length' => 11, 'regex' => '^374\d{8}$', 'mask' => '(__) ___-___',], // Армения
        'ao' => ['code' => 244, 'length' => 12, 'regex' => '^244\d{9}$', 'mask' => '___ ___ ___',], // Ангола
        'ar' => ['code' => 54, 'length' => 12, 'regex' => '^54\d{10}$', 'mask' => '___ ___-____',], // Аргентина
        'at' => ['code' => 43, 'length' => 9, 'length_max' => 13, 'regex' => '^43\d{7,11}$', 'mask' => '___ ______',], // Австрия
        'au' => ['code' => 61, 'length' => 11, 'regex' => '^61\d{9}$', 'mask' => '___ ___ ___',], // Австралия
        'az' => ['code' => 994, 'length' => 12, 'regex' => '^994\d{9}$', 'mask' => '(__) ___-__-__',], // Азербайджан
        'ba' => ['code' => 387, 'length' => 11, 'regex' => '^387\d{8}$', 'mask' => '___ ___ __',], // Босния и Герцеговина
        'bb' => ['code' => 1, 'length' => 11, 'regex' => '^1246\d{7}$', 'mask' => '(246) ___-____',], // Барбадос
        'bd' => ['code' => 880, 'length' => 13, 'regex' => '^880\d{10}$', 'mask' => '____-______',], // Бангладеш
        'be' => ['code' => 32, 'length' => 11, 'regex' => '^32\d{9}$', 'mask' => '___ __ __ __',], // Бельгия
        'bg' => ['code' => 359, 'length' => 12, 'regex' => '^359\d{9}$', 'mask' => '___ ___ ___',], // Болгария
        'bh' => ['code' => 973, 'length' => 11, 'regex' => '^973\d{8}$', 'mask' => '____ ____',], // Бахрейн
        'bo' => ['code' => 591, 'length' => 11, 'regex' => '^591\d{8}$', 'mask' => '____ ____',], // Боливия
        'br' => ['code' => 55, 'length' => 13, 'regex' => '^55\d{11}$', 'mask' => '(__) _____-____',], // Бразилия
        'bs' => ['code' => 1, 'length' => 11, 'regex' => '^1242\d{7}$', 'mask' => '(242) ___-____',], // Багамы
        'by' => ['code' => 375, 'length' => 12, 'regex' => '^375\d{9}$', 'mask' => '(__) ___-__-__',], // Беларусь
        'bz' => ['code' => 501, 'length' => 10, 'regex' => '^501\d{7}$', 'mask' => '__ ____ _',], // Белиз
        'ca' => ['code' => 1, 'length' => 11, 'regex' => '^1[2-9]\d{9}$', 'mask' => '(___) ___-____',], // Канада
        'ch' => ['code' => 41, 'length' => 11, 'regex' => '^41\d{9}$', 'mask' => '__ ___ __ __',], // Швейцария
        'cl' => ['code' => 56, 'length' => 11, 'regex' => '^56\d{9}$', 'mask' => '_ ____ ____',], // Чили
        'cn' => ['code' => 86, 'length' => 13, 'regex' => '^86\d{11}$', 'mask' => '___ ____ ____',], // Китай
        'co' => ['code' => 57, 'length' => 12, 'regex' => '^57\d{10}$', 'mask' => '___ ___ ____',], // Колумбия
        'cr' => ['code' => 506, 'length' => 11, 'regex' => '^506\d{8}$', 'mask' => '____ ____',], // Коста-Рика
        'cu' => ['code' => 53, 'length' => 10, 'regex' => '^53\d{8}$', 'mask' => '____ ____',], // Куба
        'cy' => ['code' => 357, 'length' => 11, 'regex' => '^357\d{8}$', 'mask' => '____ ____',], // Кипр
        'cz' => ['code' => 420, 'length' => 12, 'regex' => '^420\d{9}$', 'mask' => '___ ___ ___',], // Чехия
        'de' => ['code' => 49, 'length' => 9, 'length_max' => 15, 'regex' => '^49\d{7,13}$', 'mask' => '___ ________',], // Германия
        'dk' => ['code' => 45, 'length' => 10, 'regex' => '^45\d{8}$', 'mask' => '__ __ __ __',], // Дания
        'do' => ['code' => 1, 'length' => 11, 'regex' => '^1(809|829|849)\d{7}$', 'mask' => '(8__) ___-____',], // Доминикана
        'dz' => ['code' => 213, 'length' => 12, 'regex' => '^213\d{9}$', 'mask' => '___ __ __ __',], // Алжир
        'ec' => ['code' => 593, 'length' => 11, 'regex' => '^593\d{8}$', 'mask' => '___ ___ ___',], // Эквадор
        'ee' => ['code' => 372, 'length' => 11, 'regex' => '^372\d{8}$', 'mask' => '____ ____',], // Эстония
        'eg' => ['code' => 20, 'length' => 12, 'regex' => '^20\d{10}$', 'mask' => '__ ____ ____',], // Египет
        'es' => ['code' => 34, 'length' => 11, 'regex' => '^34\d{9}$', 'mask' => '___ __ __ __',], // Испания
        'et' => ['code' => 251, 'length' => 12, 'regex' => '^251\d{9}$', 'mask' => '___ ___ ___',], // Эфиопия
        'fi' => ['code' => 358, 'length' => 12, 'regex' => '^358\d{9}$', 'mask' => '__ ___ ____',], // Финляндия
        'fo' => ['code' => 298, 'length' => 9, 'regex' => '^298\d{6}$', 'mask' => '___ ___',], // Фарерские острова
        'fr' => ['code' => 33, 'length' => 11, 'regex' => '^33\d{9}$', 'mask' => '_ __ __ __ __',], // Франция
        'ge' => ['code' => 995, 'length' => 12, 'regex' => '^995\d{9}$', 'mask' => '(___) ___-__-__',], // Грузия
        'gb' => ['code' => 44, 'length' => 12, 'regex' => '^44\d{10}$', 'mask' => '____ ______',], // Великобритания
        'gi' => ['code' => 350, 'length' => 11, 'regex' => '^350\d{8}$', 'mask' => '____ ____',], // Гибралтар
        'gh' => ['code' => 233, 'length' => 12, 'regex' => '^233\d{9}$', 'mask' => '___ ___ ___',], // Гана
        'gr' => ['code' => 30, 'length' => 12, 'regex' => '^30\d{10}$', 'mask' => '___ ___ ____',], // Греция
        'gt' => ['code' => 502, 'length' => 11, 'regex' => '^502\d{8}$', 'mask' => '____ ____',], // Гватемала
        'gy' => ['code' => 592, 'length' => 10, 'regex' => '^592\d{7}$', 'mask' => '__ ____ _',], // Гайана
        'hn' => ['code' => 504, 'length' => 11, 'regex' => '^504\d{8}$', 'mask' => '____ ____',], // Гондурас
        'hr' => ['code' => 385, 'length' => 11, 'length_max' => 12, 'regex' => '^385\d{8,9}$', 'mask' => '___ ___ ___',], // Хорватия
        'ht' => ['code' => 509, 'length' => 11, 'regex' => '^509\d{8}$', 'mask' => '____ ____',], // Гаити
        'hu' => ['code' => 36, 'length' => 11, 'regex' => '^36\d{9}$', 'mask' => '__ ___ ____',], // Венгрия
        'id' => ['code' => 62, 'length' => 12, 'length_max' => 14, 'regex' => '^62\d{10,12}$', 'mask' => '___-____-____',], // Индонезия
        'ie' => ['code' => 353, 'length' => 12, 'regex' => '^353\d{9}$', 'mask' => '___ ___ ___',], // Ирландия
        'il' => ['code' => 972, 'length' => 12, 'regex' => '^972\d{9}$', 'mask' => '__-___-____',], // Израиль
        'in' => ['code' => 91, 'length' => 12, 'regex' => '^91\d{10}$', 'mask' => '_____ _____',], // Индия
        'iq' => ['code' => 964, 'length' => 13, 'regex' => '^964\d{10}$', 'mask' => '___ ___ ____',], // Ирак
        'ir' => ['code' => 98, 'length' => 12, 'regex' => '^98\d{10}$', 'mask' => '___ ___ ____',], // Иран
        'is' => ['code' => 354, 'length' => 10, 'regex' => '^354\d{7}$', 'mask' => '__ ___ ___',], // Исландия
        'it' => ['code' => 39, 'length' => 12, 'regex' => '^39\d{10}$', 'mask' => '___ ___ ____',], // Италия
        'jm' => ['code' => 1, 'length' => 11, 'regex' => '^1876\d{7}$', 'mask' => '(876) ___-____',], // Ямайка
        'jo' => ['code' => 962, 'length' => 12, 'regex' => '^962\d{9}$', 'mask' => '__ ___ ____',], // Иордания
        'jp' => ['code' => 81, 'length' => 12, 'regex' => '^81\d{10}$', 'mask' => '__-____-____',], // Япония
        'ke' => ['code' => 254, 'length' => 12, 'regex' => '^254\d{9}$', 'mask' => '___ ___ ___',], // Кения
        'kg' => ['code' => 996, 'length' => 12, 'regex' => '^996\d{9}$', 'mask' => '(___) ___-___',], // Кыргызстан
        'kr' => ['code' => 82, 'length' => 12, 'regex' => '^82\d{10}$', 'mask' => '__-____-____',], // Южная Корея
        'kw' => ['code' => 965, 'length' => 11, 'regex' => '^965\d{8}$', 'mask' => '____ ____',], // Кувейт
        'kz' => ['code' => 7, 'length' => 11, 'regex' => '^77\d{9}$', 'mask' => '(7__) ___-__-__',], // Казахстан
        'lb' => ['code' => 961, 'length' => 11, 'regex' => '^961\d{8}$', 'mask' => '__ ___ ___',], // Ливан
        'li' => ['code' => 423, 'length' => 10, 'regex' => '^423\d{7}$', 'mask' => '__ ___ ___',], // Лихтенштейн
        'lk' => ['code' => 94, 'length' => 11, 'regex' => '^94\d{9}$', 'mask' => '__ ___ ____',], // Шри-Ланка
        'lt' => ['code' => 370, 'length' => 11, 'regex' => '^370\d{8}$', 'mask' => '____ ____',], // Литва
        'lu' => ['code' => 352, 'length' => 12, 'regex' => '^352\d{9}$', 'mask' => '___ ___ ___',], // Люксембург
        'lv' => ['code' => 371, 'length' => 11, 'regex' => '^371\d{8}$', 'mask' => '____ ____',], // Латвия
        'ly' => ['code' => 218, 'length' => 12, 'regex' => '^218\d{9}$', 'mask' => '__-___-____',], // Ливия
        'ma' => ['code' => 212, 'length' => 12, 'regex' => '^212\d{9}$', 'mask' => '___-______',], // Марокко
        'mc' => ['code' => 377, 'length' => 11, 'regex' => '^377\d{8}$', 'mask' => '___ ___ __',], // Монако
        'md' => ['code' => 373, 'length' => 11, 'regex' => '^373\d{8}$', 'mask' => '(___) __-___',], // Молдова
        'me' => ['code' => 382, 'length' => 11, 'regex' => '^382\d{8}$', 'mask' => '___ ___ __',], // Черногория
        'mk' => ['code' => 389, 'length' => 11, 'regex' => '^389\d{8}$', 'mask' => '___ ___ __',], // Северная Македония
        'mm' => ['code' => 95, 'length' => 12, 'regex' => '^95\d{10}$', 'mask' => '_ ___ ___ ___',], // Мьянма
        'mn' => ['code' => 976, 'length' => 11, 'regex' => '^976\d{8}$', 'mask' => '____ ____',], // Монголия
        'mt' => ['code' => 356, 'length' => 11, 'regex' => '^356\d{8}$', 'mask' => '____ ____',], // Мальта
        'my' => ['code' => 60, 'length' => 10, 'length_max' => 12, 'regex' => '^60\d{8,10}$', 'mask' => '__-___ ____',], // Малайзия
        'mx' => ['code' => 52, 'length' => 12, 'regex' => '^52\d{10}$', 'mask' => '___ ___ ____',], // Мексика
        'ng' => ['code' => 234, 'length' => 13, 'regex' => '^234\d{10}$', 'mask' => '___ ___ ____',], // Нигерия
        'ni' => ['code' => 505, 'length' => 11, 'regex' => '^505\d{8}$', 'mask' => '____ ____',], // Никарагуа
        'nl' => ['code' => 31, 'length' => 11, 'regex' => '^31\d{9}$', 'mask' => '_ ____ ____',], // Нидерланды
        'no' => ['code' => 47, 'length' => 10, 'regex' => '^47\d{8}$', 'mask' => '___ __ ___',], // Норвегия
        'np' => ['code' => 977, 'length' => 13, 'regex' => '^977\d{10}$', 'mask' => '___-_______',], // Непал
        'nz' => ['code' => 64, 'length' => 11, 'regex' => '^64\d{9}$', 'mask' => '__ ___ ____',], // Новая Зеландия
        'om' => ['code' => 968, 'length' => 11, 'regex' => '^968\d{8}$', 'mask' => '____ ____',], // Оман
        'pa' => ['code' => 507, 'length' => 11, 'regex' => '^507\d{8}$', 'mask' => '____ ____',], // Панама
        'pe' => ['code' => 51, 'length' => 11, 'regex' => '^51\d{9}$', 'mask' => '___ ___ ___',], // Перу
        'ph' => ['code' => 63, 'length' => 12, 'regex' => '^63\d{10}$', 'mask' => '___ ___ ____',], // Филиппины
        'pk' => ['code' => 92, 'length' => 12, 'regex' => '^92\d{10}$', 'mask' => '___ _______',], // Пакистан
        'pl' => ['code' => 48, 'length' => 11, 'regex' => '^48\d{9}$', 'mask' => '___ ___ ___',], // Польша
        'pt' => ['code' => 351, 'length' => 12, 'regex' => '^351\d{9}$', 'mask' => '___ ___ ___',], // Португалия
        'py' => ['code' => 595, 'length' => 12, 'regex' => '^595\d{9}$', 'mask' => '___ ___ ___',], // Парагвай
        'qa' => ['code' => 974, 'length' => 11, 'regex' => '^974\d{8}$', 'mask' => '____ ____',], // Катар
        'ro' => ['code' => 40, 'length' => 11, 'regex' => '^40\d{9}$', 'mask' => '___ ___ ___',], // Румыния
        'rs' => ['code' => 381, 'length' => 12, 'regex' => '^381\d{9}$', 'mask' => '___ ___ ___',], // Сербия
        'ru' => ['code' => 7, 'length' => 11, 'regex' => '^7(?!7)\d{10}$', 'mask' => '(___) ___-__-__',], // Россия
        'rw' => ['code' => 250, 'length' => 12, 'regex' => '^250\d{9}$', 'mask' => '___ ___ ___',], // Руанда
        'sa' => ['code' => 966, 'length' => 12, 'regex' => '^966\d{9}$', 'mask' => '___ ___ ___',], // Саудовская Аравия
        'sg' => ['code' => 65, 'length' => 10, 'regex' => '^65\d{8}$', 'mask' => '____-____',], // Сингапур
        'si' => ['code' => 386, 'length' => 11, 'regex' => '^386\d{8}$', 'mask' => '__ ___ __ __',], // Словения
        'sk' => ['code' => 421, 'length' => 12, 'regex' => '^421\d{9}$', 'mask' => '___ ___ ___',], // Словакия
        'sv' => ['code' => 503, 'length' => 11, 'regex' => '^503\d{8}$', 'mask' => '____ ____',], // Сальвадор
        'th' => ['code' => 66, 'length' => 11, 'regex' => '^66\d{9}$', 'mask' => '_ ____ ____',], // Таиланд
        'tj' => ['code' => 992, 'length' => 12, 'regex' => '^992\d{9}$', 'mask' => '(___) __-__-__',], // Таджикистан
        'tn' => ['code' => 216, 'length' => 11, 'regex' => '^216\d{8}$', 'mask' => '____ ____',], // Тунис
        'tr' => ['code' => 90, 'length' => 12, 'regex' => '^90\d{10}$', 'mask' => '(___) ___ ____',], // Турция
        'tt' => ['code' => 1, 'length' => 11, 'regex' => '^1868\d{7}$', 'mask' => '(868) ___-____',], // Тринидад и Тобаго
        'tz' => ['code' => 255, 'length' => 12, 'regex' => '^255\d{9}$', 'mask' => '___ ___ ___',], // Танзания
        'ua' => ['code' => 380, 'length' => 12, 'regex' => '^380\d{9}$', 'mask' => '___ ___ __ __',], // Украина
        'ug' => ['code' => 256, 'length' => 12, 'regex' => '^256\d{9}$', 'mask' => '___ ___ ___',], // Уганда
        'us' => ['code' => 1, 'length' => 11, 'regex' => '^1[2-9]\d{9}$', 'mask' => '(___) ___-____',], // США
        'uy' => ['code' => 598, 'length' => 11, 'regex' => '^598\d{8}$', 'mask' => '___ ___ ___',], // Уругвай
        've' => ['code' => 58, 'length' => 11, 'regex' => '^58\d{9}$', 'mask' => '___-_______',], // Венесуэла
        'vn' => ['code' => 84, 'length' => 11, 'length_max' => 12, 'regex' => '^84\d{9,10}$', 'mask' => '___ ___ ____',], // Вьетнам
        'za' => ['code' => 27, 'length' => 11, 'regex' => '^27\d{9}$', 'mask' => '__ ___ ____',], // ЮАР
    ],
];
